{
  "recipients": [
    {
      "image": "src\/assets\/images\/recipients\/2015\/handsforafrica1-copy.png",
      "name": "Alton Harding",
      "bio": "Alton Harding is the founder and president of Hands for Africa. Alton’s work provides prosthetics to amputees in Africa. A lot of these amputees are victims from a civil war back in early 1990s. He’s given fervent life and hope to these individuals. Those that didn’t have limbs, now have prosthetics that enable them to find work, to provide for their families, to stand proud with dignity and truly restore self-esteem in these individuals. Some have gone on to participate in recreational sports, such as soccer and cricket. Where others are grateful by the sheer reality of being able to stand up tall and take one step after the other. He has also built water wells, provided micro loans to countless individuals and student scholarships to the youth. His work has changed and added to the quality of life to so many and he continues his work vigorously and with passion and conviction.\n\nAlton sets a true and genuine example for us all. Everyone that meets him is touched and inspired in one way or another to do good for the world. In his own words, “It doesn’t matter how big or small you give, so as long as you give what you genuinely can, you make change and create impact in the lives that need it more than you.” His work has greatly added to the quality of life of thousands, he has truly restored hope that was once lost, in countless individuals.\n\nAlton cares about providing the means to self-sufficiency. If he is able to give those the ability to walk or the ability to use their arms to eat or to work and earn money, to finally carry their child in their arms, he’s restored one of the most important aspects of an individual’s existence, their identity.\n\nTo learn more, please visit: http:\/\/www.handsforafrica.org \n",
      "year": "2015",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2015\/Barbara-Gray.png",
      "name": "Barbara Gray",
      "bio": "Barbara Gray\n\nAfter years of her own personal medical struggles, Barbara Gray discovered the healing power of Physical Therapy and wanted to share the gift with those that lack access to such care. With this passion, Barbara, along with John Gray, Dan Jones and Yousef Ghandour, founded Physical Therapy For All, a new nonprofit organization located in San Diego, California. Physical Therapy For All helps those in need through recycling existing medical devices and equipment.\n\nBarbara’s work has thoroughly affected not only the communities of San Diego and Orange County, but also people in countries like Mexico, Nicaragua, Syria and surrounding countries. The amount of equipment that she has been able to recycle and give out to those in need is astronomical. Not only that, she has been actively contacting physical therapy clinics and other organizations in the hopes that they would ally their respective clinics\/organizations with PTFORALL.\n\nPhysical Therapy for All “recycles” used medical equipment and devise by collecting them and donating to someone in the under-served population who is in need, keeping this equipment out of landfills. These devices include wheelchairs, walkers, shower chairs, crutches, raised toilets, and many other large and small items. By giving this equipment to those in need they help their rehabilitation and quality of life while doing something positive for the planet. Hundreds of devices have been picked up and put to use at no cost to anyone.\n\nTo learn more, please visit: http:\/\/www.ptforall.org \n",
      "year": "2015",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2015\/Obrian.png",
      "name": "Christopher O’Brien",
      "bio": "Christopher O’Brien\n\nChristopher O’Brien has devoted his life to service, education and improving the lives of others. He joined the staff of the University of Nottingham in 1968 and played a major role in building up the business, management and engineering schools. From 1996 – 2001 Professor O’Brien spent a significant proportion of his time in the Far East, first as Acting Vice-Chancellor of the British University, Thailand, and then as Pro-Vice Chancellor of the University of Nottingham for Malaysia, – the first overseas campus of any UK University, In September 2007 he transferred to the University of Nottingham, Ninbgo in Ching where he was Dean of the Faculty of Social Sciences and Director of Nottingham University Business School. He retired from teaching in 2010.\n\nIn addition to his work as a University Professor, Christopher has served on the Board of Portland College, providing a ladder of opportunity of students with disabilities. He has devoted much of his free time to fund-raising so that the students could have a new learning center, sports facilities and even a little farm where they could learn skills and be rehabilitated. Chris also used his experience in management to set up printing and agricultural programs so that the students could learn business skills with a view to greater independence and graduation. \n\nChristopher is never afraid to venture to remote areas, often at great personal risk and Christopher is very sociable, caring and all around a great person.\n\nTo learn more, please visit: Portland College, UK",
      "year": "2015",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2015\/shellywoolery.png",
      "name": "Shelley Woolery",
      "bio": "Shelley Woolery\n\nCouncil on Aging – Orange County (COAOC) was fortunate enough to have Shelley Woolery come to the Council nearly three decades ago. Her kindheartedness for this frail population is resilient and her willpower to change the lives of the seniors she serves is inspiring. In 1987, Shelley answered an ad in the Penny Saver to volunteer as a Long-Term Care Ombudsman a program at the Council on Aging – Orange County (COAOC).  \n\nShelley completed the Ombudsman Training offered at Orange Coast College in late Fall of 1987 & began as a volunteer Ombudsman. The State of CA soon appointed the Long-Term Care Ombudsmen as the mandated reporting agency to receive and investigate elder abuse occurring in Long-Term Care facilities. With Shelley’s Social Work education and training, she was hired on January 26, 1988 to fill and develop the new position of Elder Abuse Prevention Coordinator. On July 1, 1998 she promoted to Ombudsman Coordinator.\n\nA Long-Term Care Ombudsman is an advocate for residents of nursing homes, board and care homes, and assisted living facilities. Ombudsmen provide information about how to select a facility and what to do to get quality care. They are trained to resolve problems, big and small. They also represent the perspective of residents in monitoring laws, regulation and policies.\n\nRochelle Woolery is an incredible women, she has been the beacon of light for some who felt in the dark. She is the voice of many elderly are searching for and has provided the guidance and support to so many Ombudsmen who take on this remarkable task alongside her. As the most seasoned Ombudsman in the program, Shelley is not famous, but everyone knows her name. \n\nTo learn more, please visit: http:\/\/www.coaoc.org\/\n",
      "year": "2015",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2015\/Santo-Ragno.png",
      "name": "Santo Ragno",
      "bio": "Santo Ragno\n\nSanto Ragno is a first generation Italian American originally from the east coast. He works as a Travel Coordinator at Warner Bros Studios in Burbank, CA. He, along with his partner of 15 years, Billy Rugh co-founded Creative Planet School of the Arts. Creative Planet, School of the Arts is a private arts magnet dedicated to providing a space for accelerated Academic training, intense Arts education, creative expression, and community outreach. Creative Planet, a non-profit, private elementary school, provides students with personalized, high-energy instruction in both academics and the arts including all areas of dance, acting, music and visual arts. CPSOA offers an accelerated approach to K-8th grade academia that believes all students have the ability to achieve high levels of education when given the self-esteem, discipline, and opportunity to excel in a safe, nurturing and positive environment. In 2006, Santo received the Time Warner Andrew Heiskell Award Time Warner Chairman, Dick Parsons for his work with Creative Planet.\n\nSanto met his partner Billy while singing with the Gay Men’s Chorus of Los Angeles in 2000. GMCLA, has been performing for more than 35 years. Santo has also toured with GMCLA to be the first gay chorus to sing in Moscow, St. Petersburg, Helsinki, Tallinn as well as the South American cities of Santiago, Montevideo, Buenos Aires, and Rio. Santo performed in concert in all these cities, while also reaching out to the AIDS community, providing nutritional supplies and moral support, assisting with budding gay choruses and providing general outreach to the LDBT communities. \n\nIn 2009 Santo and his partner Billy, along with 30 doctors and social workers, took six students from their school CPSOA to Arusha, Tanzania to work with local AIDS orphans, help set up an after-school arts program, and distribute food and mosquito netting to families. While there Santo, taught after-school visual arts classes with the students from the orphanage.\n\nTo learn more, please visit: http:\/\/cpsoa.org\n",
      "year": "2015",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2015\/Jensons.png",
      "name": "John and Susan Jenson",
      "bio": "John and Susan Jenson\n\nJohn and Susan Jenson put on health fairs and cooking schools to reach out to the community and educate them. They are teaching people how to disease proof their bodies. As a dietitian, Susan has a wealth of knowledge on nutrition and lifestyle, which she gladly shares for free. Susan also films her programs and reaches out to thousands of people through media as well. \n\nThe work that John and Susan Jenson do is far reaching because it is part of a growing awareness throughout the world.  \n\nTo learn more, please visit: http:\/\/www.southbaychurch.net\n",
      "year": "2015",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2015\/Elena.png",
      "name": "Elena Kabakchieva",
      "bio": "Elena Kabakchieva\n\nElena Kabakchieva is the Chairwoman of The Health and Social Development Foundation (Hesed) which she founded in 1998. The Foundation is a leader in the development and implementation of a new approach for successful integration of the Roma community in Bulgaria. It is a social organization that breaks the vicious cycle of poverty and puts vulnerable groups on a positive path of development.\nElena and her colleagues work tirelessly to bring an effective service for planning family and\nparenthood at an appropriate age and specific social and economic conditions in order to minimize the risk for institutionalization of children.\n\n“As evidence of our success, the children in our programs raise their academic results five times compared to children in the community without access to programs for early childhood education and development.”\n\nTo learn more, please visit: http:\/\/www.hesed.bg\/about-us\/\n",
      "year": "2015",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2015\/2015-Clinton-Sebastian.png",
      "name": "Sergeant Clinton Sebastian",
      "bio": "Sergeant Clinton Sebastian\n\nSergeant Clinton Sebastian, joined the Chicago Police Department in 1997 and was promoted to his current rank in 2009, where has upheld the finest and most noble traditions of the Chicago Police Department during his entire career of public service. \n\nOn May 11, 2014, a stolen sport utility vehicle swerved in traffic and crashed into a brick building in a rough area of downtown Chicago shortly before midnight. The driver of the damaged vehicle fled on foot while inside the vehicle lay a non-responsive child who had suffered blunt trauma. The child was removed from under the front seat by a civilian witness shortly before the vehicle burst into flames.\n\nArriving at the crash scene, Sergeant Clinton Sebastian sprang into action and performed CPR on the four-year-old boy whom he was able to resuscitate. The child was then taken by Fire Department ambulance to the University of Chicago’s Comer Children’s Hospital for recovery.\n\nSergeant Clinton Sebastian has distinguished himself in the line of duty on numerous occasions and is the recipient of the Superintendent award of Valor, 21 Department Commendations, 290 Honorable Mentions, 3 lifesaving awards as well as awards from the state and county level for valor and professionalism. The Mayor and the members of the Chicago City Council, assembled to recognize the heroic actions of Sergeant Clinton Sebastian and bestowed a commendation for his unwavering dedication and continued professionalism.\n\nAlthough being devoted to the police department is a full time job, Clinton’s devotion to his family is also of the highest priority. Through the endless support of his family, he feels able to go to work every night and achieve his goals of helping fellow officers and the citizens of the city of Chicago.\n\nTo learn more, please visit: http:\/\/home.chicagopolice.org\/\n",
      "year": "2015",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2016\/Gamboa1.jpg",
      "name": "Isaias Gamboa",
      "bio": "Isaias was born in San Jose, Costa Rica. He was born of Jewish lineage but in America, was raised in both Baptist and Catholic traditions. He self-describes himself as a faithful, devoted follower of Jesus Christ. Isaias was raised by devoutly Christian parents off different races, who believed that love, kindness and compassion for the poor and needy were the only true measures of divine faith and discipleship. Isaias has travelled to nine Latin American countries in expression of his own personal love and devotion to the poor, needy, abused and disenfranchised. He has donated toys and clothing along with his time and love to those less fortunate.\n\nIsaias is also the founder of We Shall Overcome Foundation. The We Shall Overcome Foundation is a recognized IRS 501(C)(3) faith-based non-profit organization dedicated to spiritual, educational, social and economic survival, empowerment and development of poor and marginalized people through out the world. This foundation is presently working in Brazil to love, feed, shelter, clothe, heal and Educate Brazil’s abandoned street children. In addition to providing basic human needs for these highly vulnerable children.\n\nTo learn more, please visit: http:\/\/weshallovercomefoundation.org \n",
      "year": "2016",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2016\/SarahBerthelet1.jpg",
      "name": "Sarah Berthelet",
      "bio": "Sarah Berthelet\n\nSarah works one-on-one with special needs children. She has traveled by herself to third world countries to some of the neediest areas. She not only works directly with individuals, but also provides training and information to equip others to help individuals as well. Sarah has helped establish two programs; Bring Me Hope Internship and Swing for Justice. She is a leader for the Bring Me Hope Internship in Los Angeles where she helps Chinese students learn how to help orphans and those special needs children in China. \n\nTo learn more, please visit: https:\/\/bringmehope.org \n",
      "year": "2016",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2016\/Ted-Vegvari1.jpg",
      "name": "Ted Vegvari",
      "bio": "Ted Vegvari\n\nTed Vegvari funds and manages PVNet (Palos Verdes on the Net). Ted is very passionate about providing an environment that provides opportunities not available elsewhere. Ted provides interns with projects that have a purpose to benefit the community while teaching the intern not only the computer skills needed for the marketplace but also the experience of interacting with others in business. Ted is unbelievably giving and sacrifices his needs for the betterment of the community and anyone that attends PVNet.  \n\nTo learn more, please visit: www.pvnet.com",
      "year": "2016",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2016\/Devenstory1a.jpg",
      "name": "Devin Storey",
      "bio": "Devin Storey\n\nDevin has represented victims of childhood sexual abuse in civil lawsuits for several years.  Mr. Storey frequently takes on cases pro bono (without charge) for deserving clients.  He has donated his time to help victims of child abuse file police reports or obtain counseling when other legal avenues are closed.  On a broader scale, Mr. Storey has worked tirelessly to ensure that victims of child molestation have access to the courts.  He has filed numerous amicus briefs seeking to persuade appellate courts to allow victims of child abuse more time to understand how they have been impacted and seek justice.  Mr. Storey has also been involved with several legislative efforts to expand civil and criminal deadlines to hold molesters accountable.  In total, he has donated hundreds, or perhaps thousands, of hours seeking to ensure that victims of child abuse are able to seek healing and justice. \n\nThe type of work done by Mr. Storey was recently portrayed in the movie “Spotlight”, which shed light on the epidemic of child molestation by Catholic priests within the Archdiocese of Boston.  An earlier Academy Award nominated documentary – “Deliver Us From Evil” – also highlighted the problem of child molestation by authority figures, and the role the civil justice system can play in bringing about change.\n\nTo learn more, please visit: http:\/\/www.zalkin.com\/\n",
      "year": "2016",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2016\/Vesa-Viitaniemi1.jpg",
      "name": "Vesa Viitaniemi, Phd",
      "bio": "Vesa Viitaniemi, Phd\n\nDr. Viitaniemi  is the CEO at Southwest Finland CO Bank and President of the Finnish Businessmen Mission Union.\n\nThe Finnish Businessmen Mission Union was established in 1920 and operates in Finland, Russia, Estonia, and Africa. It has had projects in Namibia, South-Africa, Ethiopia and in Tanzania.\n\nThe Honorary Consul is promoting the interests of Tanzanian citizens living in Finland, collaboration between Finnish and Tanzanian Universities, increasing business-opportunities between North and South, supporting cultural exchange between our countries and taking care of Diplomatic matters addressed to Honorary Consulate.\n\nTo learn more, please visit: http:\/\/missionmen.fi\/heavenly-assignment-taivaallinen-toimeksianto\/\n",
      "year": "2016",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2016\/Cady-Mariano1.jpg",
      "name": "Cady Mariano",
      "bio": "Cady Mariano\n\nCady is a 14 year old student who is a dance performer at the San Diego United Lions Club. There she has established the San Diego United Cubs Club in November, 2012 were she was the Charter President. This was the 1st and only Cubs Club for kids at age 8-12 in the Lions District in San Diego. \n\nShe has also established the San Diego United Leo Club in August, 2015 which she serves as the Charter President for kids at age 13 and above. Cady not only performs at the Lions Club but she also donates her own money to fundraisers for Rady Children’s Hospital, Haiti\/Japan\/Philippine\/China typhoon and earthquakes, homeless Veterans, homeless kids school “San Diego Monarch School”, and other people in need around the world. \n\nCady has also donated her long hair to “Locks of Love” for cancer kids, her first donation was in August 2012 and since then she has donated her hair two times. Cady’s work has inspired many young people to follow her example and get involved in the community services and humanitarian endeavors to help the less fortunate people. Her example and leadership helps other kids to develop compassion for the underprivileged people and also to help them develop social, organizational and leadership skills. \n\nTo learn more, please visit: http:\/\/www.sdulions.org\/about-leo-club\n",
      "year": "2016",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2016\/yeelitt1a.jpg",
      "name": "Daryl YeeLitt",
      "bio": "Daryl YeeLitt\n\nDaryl is the Chairman of Board of Directors Council on Aging – Orange County.\nThe Council was establish to Promote the Independence, health and dignity of older adults, through compassion, education and advocacy.\n\nTo learn more, please visit: http:\/\/www.coasc.org\/\n",
      "year": "2016",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2017\/ChantalBarlow.jpg",
      "name": "Chantal Barlow",
      "bio": "Chantal Barlow\n\nChantel Barlow knew her grandfather as a loving, religious, and sober man.\n\nAt the age of 16, she learned that her grandmother, Maybleine Nelson Barlow, was shot to death by her grandfather in 1975 in Compton, California in front of her father.  Maybleine died at age 36, leaving seven children motherless.  Her grandfather never served time for this crime.\n\nChantal began her Unconventional Apology Project for women of domestic violence  to allow these survivors freedom from their past violations by sharing their experiences and emotions so that they can live healthier lives.\n\nChantal’s unique approach has been recognized by USC, UCLA, the City of Los Angeles, and various magazines.\n\nTo learn more, please visit: Unconventional Apology Project",
      "year": "2017",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2017\/JimKillon.jpg",
      "name": "Jim Killon",
      "bio": "Jim Killon\n\nJim Killon created Changes for New Hope to help women and children out of poverty in Ancash Peru.  Since 2009, Jim’s foundation enhances and empowers these lives with the following goals:\n\nIntegrity: Teaches and lives Haz lo Correcto (Do the Right Thing).  In 2010, the mayor of Huarez adapted Jim’s “Haz lo Correcto” initiative and made it a city wide program.\n\nHealth: Fights malnutrition and anemia with supplements and Albebdazole (an anti-parasite medication).\n\nEducation: Provides a safe place for children and women to learn with clothing, shoes, school materials, books, games, and toys.\n\nTools: Provides eco-friendly, hand-crank washing machines to relieve women of the labor intensive hand-washing in glacier formed rivers.\n\nTo date, Jim’s foundation has helped over 6000 children.  He has also authored the books A Gringo in Peru – A Story of Compassion in Action and Living Large; Living Deliberately.\n\nTo learn more, please visit: Changes for New Hope ",
      "year": "2017",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2017\/HeidiVladyka.jpg",
      "name": "Heidi Vladyka",
      "bio": "Heidi Vladyka\n\nHeidi Vladyka, an occupational therapist at Mary Bridge Children’s Hospital in Washington, is the Director of Distributions of Push International – a non-profit organization whose mission is to provide mobility and facilitate sustainable development in the disabled community by giving wheelchairs to poor people.  As Director of Distributions, Heidi stores and ships hundreds of pieces of mobility equipment (i.e. wheelchairs, walkers, canes, etc.) to Mexico.\n\nBesides having a full time job and assisting various teams within Push International, Heidi frequently travels to a children’s therapy center in Mazatlan, Mexico.  Using neurodevelopment therapy techniques and medical equipment, Heidi helps families of children with cerebral palsy, autism, down syndrome, and visual\/auditory impairments.  She provides occupational therapy evaluations, assessments, and intervention to help these children develop their cognitive, vision, and motor skills.\n\nTo learn more, please visit: Push International",
      "year": "2017",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2017\/NeilBarnard.jpg",
      "name": "Neal D. Barnard",
      "bio": "Neal D. Barnard\n\nNeal D. Barnard, M.D., F.A.C.C., is an Adjunct Associate Professor of Medicine at the George Washington University School of Medicine and the president and founder of the Physicians Committee for Responsible Medicine (PCRM).  Founded in 1985, this non-profit, research, and advocacy organization combines the clout and expertise of more than 12,000 physicians with the dedicated actions of 150,000 members across the United States and around the world.  Its primary activities include emphasizing nutrition in medical education; conducting research into healthy diets; educating people about nutrition; shifting research from animal “models” to more effective, human-relevant studies; and promoting alternatives to chemical tests on animals.\n\nAs its founder and medical director, Dr. Barnard opened the Barnard Medical Center (BMC) in January 2016.  Its physicians, nurse practitioners, and dietitians help patients combat chronic disease with proper life-style, including a plant-based diet, and preventive medicines.\n\nDr. Barnard’s online and telephone application, the 21-Day Vegan Kickstart, has help over half a million people transition their lives to a plant-based life-style.\n\nA couple of Dr. Barnard’s achievements include: Tyson withdrew its advertisements encouraging consumers to eat chicken for a healthy heart, and Burger King had to alert its consumers that its chicken products contained PhIP.\n\nDr. Barnard hosted three television programs, author over seventy (70) scientific publications, and wrote eighteen (18) books advocating better health and nutrition.\n\nTo learn more, please visit: The Barnard Medical Center",
      "year": "2017",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2017\/Nogol-Pedram.jpg",
      "name": "Nogol Pedram",
      "bio": "Nogol Pedram\n\nNogol Pedram created the Mind the Children Foundation that helps underprivileged children, on an individual basis, in the low-income areas of Southern California with food, emotional support, self-confidence, and personal counseling.  Nogol has provided individual well-being to over 10,000 children from 340 low-income schools.  She currently visits children in Skid Row and various shelters on a weekly basis and broadens their life experiences by taking them on field trips (i.e museums, parks, camping, etc.).\n\nNogal distributes “Circle of Excellence Certificates”, or food certificates, to help parents feed their children.\n\nNogol believes that when someone takes the time to personally care, feed, counsel, and motivate underprivileged children on a one-on-one basis, it creates a healthier and more productive environment for these young lives and their communities.\n\n \n\nTo learn more, please visit: Mind the Children Organization",
      "year": "2017",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2017\/Tore-Knos.jpg",
      "name": "Tore Knos",
      "bio": "Tore Knos\n\nTore Knos, PhD., has helped victims in the Bahamas, Malaysia, Philippines, and Southern Sudan.  Working with the rotary organization Disaster Aid International, Dr. Knos meets with the local humanitarian groups to find effective logistics to organize, use, distribute, and\/or determine what supplies are needed to overcome each disaster.\n\nDr. Knos discovered that many of the people in these developing countries had major diseases because of poor sanitation and nutrition.  With improper sanitation, bacteria spreads through the water and depletes the soil of all nutrients resulting in food shortages.  His book, Urine Diverting Dehydrating Toilets, describes a safe and effective way of eliminating all pathogens from human excrement that can be used as an inexpensive fertilizer to help farmers grow crops.\n\nTo learn more, please visit: Disaster Aid International",
      "year": "2017",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2017\/Heather-Connell-2.jpg",
      "name": "Heather Connell",
      "bio": "Heather Connell\n\nHeather Connell gives hope, faith, and happiness to the children and families who have extreme disabilities, birth defects, and\/or injuries.  Shortly after filming Small Voices: The Stories of Cambodia’s Children in 2001, Heather founded the Safe Haven Medical Outreach (SHMO), a non-profit educational and therapeutic program for disabled children in Siem Riep, Cambodia.\n\nSHMO provides intervention and support for children with disabilities and medical issues, allowing them the opportunity to access the educational, medical, and therapeutic resources they need in order to reach their full potential, lead healthy lives, and reach their highest level of personal independence.\n\nSHMO supports families to access other health services, including dental care, speech therapy, medical equipment, hospital services and surgical intervention, and helps them to navigate these services so they can better understand their children’s health conditions and make informed decisions about health and medical care.\n\nSHMO’s team provides physical and occupational therapies, rehabilitation, nutritional support, health assessments and education, and ongoing monitoring and support for children with severe disabilities, multiple diagnoses, and complex medical issues.\n\nTo learn more, please visit: Safe Haven Khmer",
      "year": "2017",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2017\/photo-jarrod-taylor.jpg",
      "name": "Jarrod Taylor Foken",
      "bio": "Jarrod Taylor Foken\n\nIn 2002, Jarrod Taylor Foken, a Los Angeles Unified school teacher, created the Dance Masters Assembly to inspire and motivate students with leading break-dance and hip-hop professionals to offset the growing trend of students who had poor mental and physical health; a tendency for gang violence; selfishness and apathy; alcohol and drug abuse; and a high drop-out rate.\n\nThe Dance Masters Assembly combines comedy, dance, and urban acrobatic entertainment with student and teacher participation.  Through this entertainment and these positive role models, students are taught that they too can overcome their adversities and achieve their goals with hard-work and dedication.\n\nIn the past ten (10) years, Dance Masters Assembly has performed for over a million middle and high school students.\n\n ",
      "year": "2017",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2018\/2018_mPaneitz.jpg",
      "name": "Matthew Paneitz",
      "bio": "Long Way Home’s Executive Director, Matthew Paneitz, is a former US Peace Corps Volunteer from Texas. Matthew Paneitz was stationed in San Juan Comalapa during his Peace Corps service where he worked with youth groups through a local community development organization called Chuwi Tinamit. This organization owned land and had plans to build a park, but they lacked the funds and asked Mateo for help.\n\nPaneitz moved to Oregon and founded Long Way Home (LWH), achieving 501(c)(3) status in late 2004. He began raising funds to build Chuwi’s park, Parque Chimiyá, and, at the beginning of 2005 he returned to Comalapa to start construction.\n\nOnce Parque Chimiyá became established as a community gathering place, area residents began coming to LWH for help with other endeavors. LWH projects now include education and alternative construction.\n\nIn 2009, LWH began its most ambitious undertaking to date: the construction of a primary and vocational school using alternative methods and materials including rammed-earth and recycled tires. This school will expand the local capacity by up to 250 students, increasing educational opportunities in Comalapa. Currently most residents of Comalapa wishing to pursue education beyond middle school must travel to a city 25 km away. In January 2012, we welcomed our first students; that has led us to a successful 130 students currently enrolled at LWH from kindergarten to grade 10. Our continued construction has allowed us to increase the school’s capacity and expand the LWH family to high school students. This 2018 school year we are very proud to add 10th grade, the first year of high school, and we will be adding subsequent grade levels in the years to follow.",
      "year": "2018",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2018\/2018_fDadsetan.jpg",
      "name": "Farideh Dadsetan",
      "bio": "Dr. Farideh Kioumehr Dadsetan is the Founder and Executive Director of the International Health and Epidemiology Research Center (IHERC), a non-profit organization dedicated to the research and prevention of epidemic diseases. As part of that mission, she established the innovative Anti-Violence Campaign for Peace project in 1994. \n\nShe is a trained epidemiologist, and graduated from the University of Michigan, has served as the Director of the Health Planning Department of the National Plan and Budget Organization, has taught at Medical School and School of Public Health. She has authored numerous scientific papers and book chapters, has been an invited guest speaker in many Academic settings, as well as many television and radio programs both domestically and abroad.\n\nShe has received numerous awards, including the very first “Peace Award” from the APHA and has received distinctions from President Clinton, Vice President Al Gore, Senators Diane Feinstein and Barbara Boxer, LAUSD Board of education, and many more.\n\nDr. Kioumehr Dadsetan received her D.V.M. degree from the University of Tehran. She continued her education at the University of Michigan, School of Public Health, in Ann Arbor, Michigan earning her M.P.H. and Dr.P.H. degree in the field of Epidemiology.\n\nShe served as a Director of the Health Planning Department, and taught as a professor at a medical school and school of Public Health for many years.",
      "year": "2018",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2018\/2018_mBirney.jpg",
      "name": "Megan Birney",
      "bio": "Megan Birney, President of Unite to Light.  Unite to Light, Inc., is a 501(c)(3) nonprofit entity based in Santa Barbara, California, which provides safe, inexpensive, long-lasting solar powered lighting to be used for studying, reading, medical procedures, and other purposes by individuals and families in developing countries all over the world.\n\nIn countries where their lights replace expensive and dangerous fuels, such as kerosene, Unite to Light ask recipients to buy their light, using a portion of their early savings. This approach maximizes the number of lights which can be made available. To the extent they are able, Unite to Light also provide lights below cost or as a donation in areas where it would be a hardship to pay for some or all of the cost of the lights. Over 78,000 lights have been sent to 65 countries on 4 continents and the organization has distribution relationships with Rotary International, the Peace Corps and Direct Relief International, as well as a growing number of relationships with smaller distribution.",
      "year": "2018",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2018\/2018_bRevis.jpg",
      "name": "Brandi Revis",
      "bio": "Brandi Revis lived with, mentored and counseled underprivileged homeless children.  She elected to reside in a Boys Hope Girls Hope facility to help the homeless children on a daily basis.  She was responsible for the operations of the home and creating a family-like atmosphere that supports the development of the full child. Her major responsibilities included: daily decisions regarding health, safety, and discipline of scholars in residence; physical, emotional, social, spiritual and academic development of scholars in residence; tutoring as needed; perform necessary tasks to run a home for scholars in residence (cooking, cleaning, shopping, driving); complete required documentation of scholar activities and understand all aspects of household budget and expense tracking.  By counseling and mentoring these homeless children, many of them completed high school and applied to and were accepted by universities to continue their educations to become more productive, successful and happy members of society.",
      "year": "2018",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2018\/2018_dDubal.jpg",
      "name": "David Dubal",
      "bio": "David Dubal is internationally known as a pianist, teacher, writer, broadcaster and one of the foremost Amarican painters of our time.  An acknowledged authority on the piano literature, David’s highly acclaimed books include The Art of the Piano, The Essential Canon of Classical Music, Evenings with Horowtiz, Reflections from the Keyboard, and Conversations with Menuhin etc. \n\nDavid’s video, The Golden Age of the Piano, has been seen worldwide in four languages, and won him an Emmy award.  His book “Remembering Horowitz”, with 125 essays by world famous pianists includes a compact disc of Mr. Horowitz and David Dubal in conversation.\n\nRecipient of the first ASCAP\/Deems Taylor Award for broadcast journalism, David has won numerous other honors, including the coveted George Foster Peabody Award for innovative broadcasting.  He served as Music Director of WNCN in New York from 1967-1990, and was also producer and commentator for innumerable special broadcasts.  From 2000, David has had a program “Reflections from the Keyboard” heard on WQXR.org worldwide (105.9 New York) and as well as “The Piano Matters”, a weekly program heard on WWFM.org highlighting the piano in comparative performance.\n\nDavid has been a faculty member of The Julliard School since 1983, and joined the faculty of the Manhattan School of Music in 1994.  He has performed in recitals and lecture-recitals in forty states, conducted master classes and lectured worldwide, and judged many international competitions, including the Can Cliburn International Piano Competition.  David received the Doctor of Music from the State of University of New York (SUNY).",
      "year": "2018",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2018\/2018_kHigashi.jpg",
      "name": "Katherena Higashi",
      "bio": "Katherena Higashi is the Principal of Yattiyr ISEE Christian School and the catalyst for the school’s founding in 2010. Prior to this, she served for over five years as an associate pastor over the jr.high and sr. high ministry at HRock Church in Pasadena, CA. She also has over 28 years of youth ministry experience. Katherena is also an experienced entrepreneur with several years of business and management experience.\n\nIt was during her time in ministry that she saw firsthand the passionless instruction that students were receiving in public and private schools. She also witnessed how much her students needed emotional, spiritual, and experiential development. This, coupled with her many years of experience from home-schooling her own children, helped her to realized that education as it is exists today is inadequate in developing tomorrow’s leaders. The Yattiyr ISEE Christian School was birthed to meet this need.\n\nKatherena’s desire is to raise up a generation of excellent followers of Christ. Her passion and dedication to the school, to its faculty, and to its students flow out of this desire. She is happily married to Steven Higashi, and has two beautiful children, Hadassah and Destiny. Both daughters are enrolled at Yattiyr.",
      "year": "2018",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2018\/2018_dMontalvan.jpg",
      "name": "Denisse Montalvan",
      "bio": "When Denisse Montalvan was a college student at California State University, Dominguez Hills, she made and sold jewelry to help pay for her tuition and books.  Two years ago, Montalvan converted her homemade project into a non-profit called The Orphaned Earring, because she uses orphaned earrings — the earring leftover when its matching pair is lost — and makes a home for it within a beaded bracelet. She then sells the finished bracelet for $10 each.\n\n“People always told me, ‘I have all these orphaned earrings, and I don’t know what to do with them,’” says the Costa Rica-born, Nicaragua-raised Montalvan. “I was already helping an orphanage in Nicaragua, but I was putting a lot out of my own pocket.” She says she had just graduated and didn’t have a stable job yet, so giving back was taking too much out of her finances. “I emptied everything out of my jewelry box and made my first two bracelets out of my orphaned earrings,” says Montalvan. “One day it just hit me — how many women out there are just like me who save their orphan earrings? I’m sure they would be willing to donate. They need a home.” She says she made a one-time donation of almost $700 to buy the material needed to make the bracelets such as beads, crystals and string, but since then the non-profit business has been sustaining itself.  Since its inception, The Orphaned Earring has raised nearly $5,000 and helps feed about 30 kids a day in orphanages in Colombia, Nicaragua, Guatemala, and Mexico.",
      "year": "2018",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2018\/2018_dJames.jpg",
      "name": "Davida James",
      "bio": "Davida S. James had a big vision – to change the cultural landscape of Victor Valley. In 2013, she founded the Victor Valley Arts and Education Center (VVAEC) in order to bring a new era of professional arts and culture to the area. When only a year old, the VVAEC received a grant of $10,000 from The Community Foundation of Riverside and San Bernardino Counties to implement a project that brought the arts to underserved populations, an impressive feat for a fledgling organization.\n\nIn addition to such programs, Davida’s biggest vision for Victor Valley is to build a state of the arts performing arts center. Davida is a UCLA alumna, with a degree in English. She also attended the Penn State Dickinson School of Law in Carlisle, PA. Davida spent 20 years in arts management for the UCLA Center for the Performing Arts and the Reichhold Center in St. Thomas, U.S. Virgin Islands handling theater budgets of up to $1.2 million, marketing and box office operations.\n\nDavida is the founder of Victor Valley Arts, now known as WordSmith Productions, a professional writer of both her own work, and a freelance writer and editor for private clients and several newspapers in the High Desert.",
      "year": "2018",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2019\/2019.Dorothy.png",
      "name": "Dorothy Bausch",
      "bio": "Dorothy “Dotsie” Bausch is an Olympic silver medalist, activist, speaker, and nonprofit founder. After recovering from a life-threatening eating disorder, she found her love and talent for cycling, which led to a 14-year professional career concluding with a silver medal at the 2012 Olympics. She stars in the 2018 film “The Game Changers,” is featured in the Netflix documentary “Personal Gold,” and gave a TEDx Talk. She currently serves as the Executive Director of Switch4Good.\n\nShe founded her first nonprofit, Compassion Champs, and later founded Switch4Good in January, 2018.  Switch4Good is an athlete-driven nonprofit working toward a dairy-free future. The organization employs athlete stories with scientific research and outreach to help others “live better and do more” by ditching dairy. Bausch is the both the founder and Executive Director.  Switch4Good is revolutionizing the way people think about nutrition for athletes and everyday active folk. The long standing, dairy industry perpetuated belief that we need cow’s milk for strength, vitality and recovery is outdated and fueled only by the folks who stand to profit off of this belief. Switch4Good is here to tell the truth and embolden folks to take control of their health by eliminating all dairy from their diet.",
      "year": "2019",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2019\/2019.Frank_.png",
      "name": "Frank Tamborello",
      "bio": "Frank Tamborello is Executive Director of Hunger Action LA. He was born into a large family in a small town. He then expanded his narrow mind by traveling into the wide world, including a stint working with street children in Luanda, Angola. Upon his return to the U.S. he eventually co-founded Hunger Action LA (HALA) in 2006.  HALA’s recent milestones include the passage of the city of LA’s surplus food ordinance in 2010, the launching of LA’s first Market Match program in 2010; leading statewide advocacy efforts over years finally resulting in the repeal of the ban on CalFresh benefits for people with past felonies, organizing state advocacy to increase SSI benefits, and partnership with numerous other groups on the rights of workers, tenants, homeless persons and seniors to live with dignity and sufficient healthy affordable food.",
      "year": "2019",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2019\/2019.georgia.png",
      "name": "Georgia Weston",
      "bio": "Georgia Weston is the Founder and Executive Director of the Teen Pain Help Foundation, a 501(c)3 charitable corporation created to help children and adolescents with chronic pain by raising funds for treatment, research, education, and increased public awareness of pediatric chronic pain. She also co-founded and was the Director of Programming for Art Rx, strengthening the partnership between the USC Suzanne Dworak-Peck School of Social Work and the USC Keck School of Medicine, specifically to better understand how art impacts pain. Georgia has experience creating and leading programs for organizations that provide therapeutic services for struggling individuals and families. She also has clinical social work experience, both as an out-patient therapist and residential therapist, for youth dealing with complex cognitive, behavioral, and social needs. \n\nShe is the author of two books, Vienna’s Waiting and PAIN: An Owner’s Manual, where she provides insight into the mysterious world of chronic pain through her own story and the story of others. \n\nGeorgia is a therapist at a boys’ probation facility where she provides mental health services to adolescents who are currently in the juvenile justice system and their families. Georgia has experience creating and leading art workshops for organizations that provide therapeutic services for individuals with complex cognitive, behavioral health, and social needs.\n\nCurrently, Georgia is serving as the Executive Director for Creative Healing for Youth in Pain (CHYP), a nonprofit that promotes education and social support through creative healing experiences for adolescents with chronic pain and their parents. She is also working on the pediatric pain research team at the University of California, Los Angeles to develop and investigate new methods for alleviating chronic pain in youth. \n\nGeorgia has a Bachelor of Arts in psychology, with a minor in art, from St. Edward’s University.  She has a Master of Social Work degree from the University of Southern California, with a concentration in Children, Youth, and Families, as well as a specialization in Child and Adolescent Mental Health. \n\nGeorgia is dedicated to empowering youth with chronic pain and their families through creative healing techniques and social support.",
      "year": "2019",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2019\/2019.heidi_.png",
      "name": "Heidi Baker",
      "bio": "Heidi Baker (born August 29, 1959) is a Christian missionary, itinerant speaker, and the CEO of Iris Global, a Christian humanitarian organization. She is the author of several books on Christian spirituality.\n\nHeidi Baker grew up in Southern California, becoming a Christian after hearing a Navajo preacher’s message while volunteering on a Choctaw reservation. She has a Bachelor of Arts and a Master of Arts from Vanguard University, and a PhD in systematic theology from King’s College London (1995).  She met Rolland Baker, the grandson of missionary H. A. Baker, in 1979.  They married six months later in 1980; they left for the mission field two weeks after that. They were ordained as ministers in 1985.\n\nHeidi Baker founded Iris Global in 1980 with her husband Rolland, and began ministering together in Asia. Iris Global is a non-profit Christian ministry dedicated to charitable service and evangelism, particularly in developing nations.\n\nIn 1995, the Bakers moved to Mozambique in order to begin a new ministry focused on the care of orphaned and abandoned children. A year later, Heidi became sick with tuberculosis and pneumonia, but despite her doctor’s recommendation, she went to a healing meeting in Toronto, Canada. There, she had a vision where Jesus showed her thousands of children to feed; when she exclaimed that it was impossible to help them all, he said “There will always be enough, because I died.” After which, she was healed.\n\nIris Global negotiated with the Mozambican government to assume financial and administrative responsibility for a former government orphanage in Chihango, near the capital city of Maputo. There were roughly 80 children present. Since that time Iris Global’s operations have expanded to include well-drilling, free health clinics, village feeding programs, the operation of primary and secondary schools, cottage industries and the founding more than 5000 churches in Mozambique, with a total of over 10,000 Iris-affiliated churches in more than 20 nations. Their ministry is known for its reports of miracles, and in September 2010 the Southern Medical Journal published an article presenting evidence of “significant improvements” in auditory and visual function among subjects exhibiting impairment before receiving prayer from the ministry.\nBeyond her administrative duties the Bakers are authors and frequent conference speakers, traveling worldwide to speak on Christian ministry and spirituality. Candy Gunther Brown, professor of religious studies at Indiana University, has called the Bakers “among the most influential leaders in world Pentecostalism.”\n\nHeidi is now “Mama Heidi” to thousands of children, and oversees a broad holistic ministry that includes Bible schools, medical clinics, church-based orphan care, well drilling, primary schools, evangelistic and healing outreaches in remote villages and a network of thousands of churches. She has BA, MA and PhD degrees, has authored four books and travels the world as a conference speaker.",
      "year": "2019",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2019\/2019.michelle.png",
      "name": "Michelle Jewsbury",
      "bio": "Michelle Jewsbury was born in Sandpoint Idaho.  She is an American Actress, Author, and Humanitarian. She is known for her acclaimed one-person show “But I Love Him”, which is now being turned into a memoir about her personal experience in an abusive relationship. She is a crusader against Domestic Violence and is a spokesperson and advocate for Domestic Violence survivors.  She is CEO\/Founder of Unsilenced Voices, a non-profit organization focused on eradicating domestic abuse and sexual gender-based violence worldwide.  She has been interviewed on major networks and was recently seen on TradioV, interviewed on CalCoast news, and featured in The Collaborative Post.  She wrote, produced and performed a critically acclaimed play to a nearly sold out audience based on her experience with domestic violence in 2016.  She has traveled to over ten countries encouraging individuals to overcome their past to achieve success in their future.  She has been speaking and coaching internationally for over three years.  Michelle has partnered with Young Vision Africa as head of public relations, and is helping YVA grow in strength and influence. Michelle has been to five continents as an advocate for the less fortunate. She does all of because she is passionate about using her natural talents to make the world a better place.\n\nMichelle is a trusted, essential asset to millions worldwide, coaching and empowering people who have experienced extreme difficulties and unforeseen circumstances.  Her passion is to empower, encourage, and enlighten individuals to create massive success in business and personal relationships and to develop essential lifelong skills to overcome obstacles so they can impact the world.  She has a very successful background in sales and marketing and has spent over ten years collaborating with successful business owners increasing sales, productivity, and overall success.  She in an innovator with a remarkable ability to use her story to help others navigate through life.",
      "year": "2019",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2019\/2019.penny_.png",
      "name": "Penny Lambright",
      "bio": "Penny Lambright is the Founder and the CEO of Patriots and Paws.  Patriots and Paws started out of a need of taking care of our Veterans, Active Duty, and Reservist. Penny’s nephew who at the time had served two tours in Afghanistan and Iraq came home and brought to Penny’s attention the fact that some of his soldiers were in need and there were no options for them. Penny’s dad served in World War II and Korea and was in seven major battles before he was twenty-one. He built furniture in the 50’s out of fruit crates, the need was as prevalent as it is today, there is just more attention brought to it now, then there was then. \n\nIn late 2011, Patriots and Paws became a nonprofit and in its first year it took care of over 250 families, then the following year 500 families, then 954 families.  In 2015, the organization helped 1006 families and in 2016 the organization helped 981 families. It is an all volunteer organization and just last year the volunteers put in over 14,500 hours.\n\nAt Patriots and Paws, the organization takes care of any Veteran, Active Duty, and Reservist throughout Southern California from Fresno to the Arizona border to the Mexican border to the Pacific Ocean.\n\nThe Paws part of the organization is that it will unite a rescued animal with a Veteran who would like an animal so that it can be trained to become a service animal.  The organization works with two local agencies that are Veteran owned that train the Veterans and their dogs to become service animals.  This gives a purpose and saves two lives.\n\nPatriots and Paws does not take government funding as it would place limitations on those that the organization can help. \n\nThe organization would like to expand to Las Vegas and Phoenix and even across the nation in the next five to ten years. In the next one to two years, the organization would like to expand its Paws program.  \n\nThe organization would like to have a kennel that would be open to the public.  The kennel would allow the organization to provide a place for a Veteran to place an animal when the Veteran gets medical treatments or help for drugs or alcohol.  Many Veterans do not get medial treatments because they don’t have a place to take their pet.  The kennel would be a way to support them and they would still be able to have their animal when they came back. In the military, you were taught to leave no one behind and they will not leave behind their four legged family members.",
      "year": "2019",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2019\/2019.proscovia.png",
      "name": "Proscovia Namazzi",
      "bio": "Proscovia Namazzi, (or Precious as fondly called by her friends), born and raised in Uganda, is the Ambassador, CEO and Founder of Precious Kids Foundation (PKF).  Precious Kids Foundation is a fundable 501(c)3 nonprofit oganization based in San Francisco, CA which conducts free medical mission camps in rural communities of Uganda and other African countries to decrease the high rising rate of preventable causes that have led to many premature deaths and a high increase in orphans and widows.\n\nPrecious Kids Foundation also takes care of orphans, widows, and individuals in underserved rural villages of Uganda and other African countries in hopes of educating, equipping, and empowering them to be healthier, productive, and self-sustained citizens of their countries.\n\nAs a resident of the United States for over twenty years, Precious has worked as a seasoned Neuroscience Registered Nurse for over fourteen years and a socially conscious entrepreneur for over seven years.  Precious is also a mentor to women, girls, and boys in different countries.\n\nPrecious has dedicated her life to improve the lives of orphans, widows, and single mothers in underserved rural communities for the last twelve years as well as teach them through skills development to increase self sustainability.\n\nPrecious uses her nursing, leadership, and entrepreneurial skills and expertise to be a solution to decrease the alarming rates of preventable premature deaths that have caused increasing numbers of orphans and widows that is rampant not only in Uganda but across Africa, of which the organization Precious Kids Foundation serves.\n\nIn September 2018, Precious Kids Foundation took a team of eleven volunteers comprised of doctors, nurses, life coaches, socially conscious entrepreneurs, and other non-medical volunteers, and set up medical camps in three different villages in Uganda.  After five days, they treated 4,767 patients, delivered 2 baby girls, performed 1,020 Dental extractions, and provided 850 eye glasses.  \n\nThis year in September 2019, Precious Kids Foundation is gearing up to take more volunteers and estimates to treat about 7,000 patients in villages in Uganda.",
      "year": "2019",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2019\/2019.william.png",
      "name": "William Dorfman",
      "bio": "Dr. William “Bill” Dorfman is a highly sought after motivational leader for young adults and the Co-founder of the nonprofit, LEAP.  LEAP – Leadership, Excellence, & Accelerating YOUR Potential is a summer scholarship program for students and young adults to help obtain valuable life skills that the wouldn’t otherwise learn in a traditional classroom setting.  Skills such as business etiquette, time management, making a first impression, etc. are all taught through seminars, celebrity speakers, and mentors.\n\nDr. Dorfman is a recipient of 14 lifetime achievement awards and is well-known for being featured on shows like ABC’s Extreme Makeover and CBS’s The Doctors. Having co-founded one of the world’s leading dental companies, Discus Dental, Dr. Dorfman has continued to do exceptional work in dentistry–helping thousands of patients smile for over 20 years.\n\nThroughout his accomplished career, Dr. Dorfman has been committed both to educating the public about the world of dentistry and to giving back to the community.  In association with The Crown Council of Dentistry, Dr. Dorfman has offered Discus Dental’s assistance in donating all of the whitening materials for its annual four-month charity campaign, Smiles for Life.  Each year, The Crown Council dentists donate their time and services to offer consumers tooth whitening at a lower rate.  Then 100% of the money earned is donated to country singer Garth Brook’s “Teammates for Kids Foundation”, which in turn gives to children’s charities across the U.S.  Thus far, they have raised and donated more than $25 million to more than 115 children’s charities, including St. Jude’s Children’s Research Hospital and The Children’s Dental Center. In addition, Dr. Dorfman is dedicated to aiding the many graduates of Los Angeles’ Battered Women’s Shelter, a downtown refuge that helps survivors of harrowing physical violence heal and rejoin the world.  Since 1997, Dr. Dorfman has helped restore the smiles of abused wives, rape victims, former prostitutes, drug addicts, and unfortunate women at no charge in order to assist them on their path to confidence.  He recently traveled to South Africa to help raise money and awareness for Tomorrow’s Trust, a non-profit organization that helps orphan children affected by HIV and AIDS.  His humanitarian and philanthropic involvement has led to his recent recognition by his alma mater, receiving the 2009 UCLA Community Service Award – one of the top honors.",
      "year": "2019",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2020\/2020.alvaray.png",
      "name": "Alvaray Antoine",
      "bio": "Alvaray Antoine grew up mistrusting church and religious institutions.  It was in prison that Alvaray surrendered her life to Lord.  Upon her release from prison, Alvaray became a mentor and motivator to other women in prison.  She assisted them with the transition back into society.  With over twenty years of sobriety, Alvaray has become a role model to individuals overcoming substance abuse, homelessness, and poverty.  She organized and founded God Chose Us Community Center.  Her organization offers quarterly feeding programs for the homeless, clothing and shoes drives for the Dominican Republic, annual picnics for those celebrating sobriety, and mentors and assists victims of human trafficking and sexual exploitation with life skills.",
      "year": "2020",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2020\/2020.courtney-1.png",
      "name": "Courtney Carag",
      "bio": "Courtney (“Crow”) Carag is proprietor of Community Care Collective. She works with patients of all ages and backgrounds. She commonly treats pediatric conditions, hormonal imbalances, women’s health issues, digestive issues, chronic inflammatory conditions, and provides pre- and post-surgical care to optimize healing. Courtney has always provided a sliding scale to make payments affordable for all patients and also provides free treatments.  Her practice has also provided various support groups since 2016.\n\nIn response to COVID-19, Courtney has recently shifted her humanitarian efforts. In March 2020, as soon as she realized that it might no longer be safe to see her clients in person or for her organization to carry on with their in-person programming, she explored other possibilities for how she could best support her community. She turned her resources to serving people without housing in Denver. She has no professional background in food security but that did not deter her from figuring out how to serve her community members. She realized that people experiencing homelessness would quickly be competing for access to food given the number of people who, overnight, had to turn to food banks as businesses throughout our city closed their doors.   Courtney began to mobilize new resources so that she could put together and deliver hundreds of lunches, dinners, bottled water, and hygiene supplies to unhoused people in downtown Denver six days a week. She has been doing this work every week since mid-March with few people assisting her and scant funds and this branch of her work has become a permanent facet of her work. She is now laying the foundation required to make food security an additional major component of her organization’s mission and programming. She plans to refurbish a shuttered grocery store in her organization’s neighborhood which is now a food desert and have the store operate as a donation-based grocery store where anyone can shop for affordable\/free fresh foods with dignity.\n\nCourtney received her Doctorate of Naturopathic Medicine and her Master’s in Acupuncture and Oriental Medicine from Bastyr University. She performed her Residency at a general family practice clinic in the Vail Valley. She also teaches Pharmacology at the Colorado School of Traditional Chinese Medicine in Denver. She has worked and studied internationally, including three internships integrating Western Medicine and Chinese Medicine in China & Taiwan. Additionally, she has advanced training in Pediatrics, Women’s Health and Fertility, Digestive Health, Visceral Manipulation, Homeopathy, and Detoxification\/ Drug Recovery Support.",
      "year": "2020",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2020\/2020.denton.png",
      "name": "Denton Knapp",
      "bio": "Denton Knapp is the Director of the Tierney Center for Veteran Services at Goodwill Industries of Orange County, California. He is an expert in leadership and character development, serving over 30 years as an Infantry Officer in the U.S. Army and Joint assignments. He retired honorably as a Colonel in May 2017. He continues to serve as a Brigadier General in the California State Guard as the Deputy Commander, 40th Infantry Division, California Army National Guard. \n\nOriginally from Gillette Wyoming, Knapp graduated from the United States Military, Academy at West Point in 1987, and was commissioned an Infantry Officer. He served in numerous command and staff positions throughout his military career in Infantry Units, as well as Joint Headquarters. His service includes multiple combat tours commanding in Iraq and Afghanistan. He served as Director for the U.S. Army’s Center for the Army Profession and Ethic, commanded NATO’s Regional Support Command-East in Afghanistan, and led programs at the U.S. Special Operations Command and the Army’s Training and Doctrine Command for future concepts and capabilities. \n\nHis education includes a Bachelor of Science in Organizational Leadership from the U.S. Military Academy, West Point, NY; Master of Aeronautical Science from Embry-Riddle Aeronautical University, Daytona Beach, FL; and Master of Strategic Studies, U.S. Army War College, PA. His highest military awards include the Defense Superior Service Medal, Legion of Merit, Bronze Star Medal with Valor Device and Oakleaf Cluster, Ranger Tab, and Combat Infantryman’s Badge. \n\nHe currently serves as the Chairman for the Steering Committee of the Orange County Veterans & Military Families Collaborative; Deputy Commander, 40th Infantry Division, CA ARNG; Board Member, Greater Los Angeles Association of the United States Army; and Advisor, U.S. Veterans Business Alliance OC Chapter. He was recently selected to serve on the national advisory council to the Secretary of the Department of Veterans Affairs for Veteran Families, Caregivers, and Survivors. He is the Director of Federal Contracting for Patriot Source LLC, and serves as a training and development officer with Building Emergency Response Teams, Inc. His philanthropy includes veterans, suicide awareness, multiple sclerosis, and autism. He resides in Trabuco Canyon, Orange County, California.",
      "year": "2020",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2020\/2020.erwin_.png",
      "name": "Erwin Raphael",
      "bio": "Erwin Raphael has advocated for support for military veterans and started veteran related employee resource groups at Fiat Chrysler (FCA) as well as Hyundai Motor America.  He also established a program within his company to find jobs for over 750 service members who were returning to full-time civilian life as a way to counter veteran related depression and the high suicide rate associated with it.  Erwin also contributes over $10,000 per year of his personal money to fund scholarships for students entering his alma mater, The Ohio State University.  This year, with growing awareness of the effects of racism on young African Americans, Erwin decided it was time to form The Lantern Network, a charity organization with the expressed purpose of strengthening America by providing vision, examples, resources, opportunity and guidance to young black Americans so they can more fully contribute to building our more perfect union.  Erwin and his wife have already contributed significantly to the foundational work of this charity and will officially launch this work in October, 2020.  \n\nRaphael holds Bachelor degrees in chemistry and applied math from The Ohio State University, where he is a member of the Advisory Council to the Executive Dean of the College of Arts and Sciences. He is also a member of the Board of Directors of UCLA Health Systems.  He is a decorated veteran of the US Army for 8 years, most recently with the 416th Engineer Command. He continues as an appointed Army Reserve Ambassador for the State of California.  \n\nHe has served as a mentor to many minorities throughout his career in Corporate America.  He repeatedly receives letters, cards, phone calls, and emails thanking him for the impact he had of the lives of his mentees.  Erwin has groomed many others to become the best professional possible.  Erwin is an advocate and corporate leader for hiring, retaining, and growing diverse high performing teams (women, minorities, LGBTQ+, as an inclusive member of society.",
      "year": "2020",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2020\/2020.loren_.png",
      "name": "Loren McCoy",
      "bio": "Coach Loren McCoy is training children from all walks of life and saving them from accidental drowning everyday, especially in San Bernardino County which has the highest rate of drowning in the country.  At the age of 64, Coach Loren gets into the water year round to make sure that the children are learning the correct techniques and not hurting themselves. This style of teaching is much harder and rarely done anymore but Coach Loren believes that it’s necessary to physically show and effectively communicate to the children so they can survive in the water and swim well.  Coach Loren’s knowledge and skills in water, and his effective ability to teach and train children from all walks of life make him an exceptional instructor. With his firm voice, determination, and willingness to train even the difficult and special children, Coach Loren is an exceptional head coach.  Many families in San Bernardino are lower income and Victory Aquatics doesn’t turn students away. They find a way to get kids swimming and teach them the benefits of a team and sport.\n\nLoren is the father to three children, Ian, Rachel and Roy Diego.  In 1978, Loren graduated from the University of Kentucky which he attended on a four year athletic scholarship for swimming. After college Loren was the Head Age Group Coach for the Coronado Swim Association from 1979-1981, he was the Guatemalan National Swimming Coach where he developed eight Guatemalan swimmers for the 1984 Olympics in Los Angeles. Loren is also the 100th person to swim successfully from Catalina to the Coast of California in eighty years.",
      "year": "2020",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2020\/2020.lynn_.png",
      "name": "Lynn Tang",
      "bio": "Lynn Tang is a film and Broadway musical producer.  Before the entertainment industry, she was a Project Manager specializing in international business exchange and she has served as a management specialist for Fortune 500 companies.  In 2008, she established ST Culture Advocacy to provide a forum for showcasing international cinema and awarding academic scholarships.  Her charitable organization promotes understanding and collaboration among people from different cultures. Through the production of movies, film festivals, art, music, dance, and other venues, she has provided audiences the opportunity to see cultural activities from all over the world. Attending these productions and shows can change the individual’s perception of themselves and the world by raising awareness of a variety of universal issues.  These experiences can make them more aware, appreciative, and understanding of people from other cultures and engaged members of our community.  She was also able to promote individual career development by providing international film delegates the opportunity to network and share their talent with potential partners and others who would not otherwise have the opportunity to see them. She was also successful in helping students pursue their education and careers by providing a platform to develop their talents through academic scholarships and cultural events. Her programs have empowered people to drive positive change in themselves, their organizations, and society.",
      "year": "2020",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2020\/2020.patrick.png",
      "name": "Patrick Kucera",
      "bio": "Patrick “PK” Kucera has been a pastor for the past 30 years and is the founder of Frontline Ministries as well as taking over as the CEO of the Charitable Giving Foundation.  Patrick is known worldwide as “The Entrepreneurial Evangelist”.  He is considered the trusted voice for the entrepreneur that exists within us all. He is leading the “Revival of Revenue” and providing the solution to the 21st century money problem for the masses, the middle class, and main street small business.  He has traveled to Africa and the Philippines to help the people in these third world areas.  He has gone to places like Houston and New York after massive hurricanes in their area in order to help out the people after these natural disasters.\n\nPatrick was born in 1967 and raised in Omaha, Nebraska. He excelled in athletics and academics and was already making money in small ways from home as a young entrepreneur. In 1986, PK graduated from Creighton Prep High School and went on to Creighton University where he met his teenage sweetheart, Mari, on their very first day of college.  Patrick married Mari in 1990 and they have experienced all the joys and humor involved with raising six children—as well as the wrenching heartache and anguish of burying two other children—Patrick and Michaela.  Since 1990 they have been involved in numerous business and ministry ventures, serving in various capacities: senior pastor, church planters, life coaches, business owners and consultants, missionaries and global entrepreneurial evangelists.",
      "year": "2020",
      "isActive": true
    },
    {
      "image": "src\/assets\/images\/recipients\/2020\/2020.sarah_.png",
      "name": "Sarah O’Brien",
      "bio": "Sarah is a leader of the Rotary Club in Altadena, California.  Through the Rotary Club, she organizes scholarships for local students, teachers, veterans, and young musicians.  She has coached generations of young cellists for the National Children’s orchestra in the United Kingdom.  She has been involved in numerous fundraising performances and album projects benefiting cancer research, children’s hospitals, and mental healthcare for veterans, youth and students with disabilities.  Sarah was integral in the work that provided villagers in a remote area in Nepal with access to clean drinking water and their children with a school that was built and now served by volunteers and trained staff.  She worked on a humanitarian venture that provides basic healthcare to individuals through a healthpost in the village of Mirge and a new hospital project that is close to completion in this underserved area.  Through her fundraising work in Cambodia, lands have been cleared of landmines making the area safer for villagers.  Sarah established the non-profit organization, Service Through Entrainment, Art and Music International Inc. \n\nSarah is an accomplished cellist and in the United States and Europe, she performs benefit concerts regularly and has produced albums for the Nicole Brown Simpson Charitable Foundation and Portland College.  She collaborates with other musicians and artists for fundraising events.",
      "year": "2020",
      "isActive": true
    }
  ]
}
